site/03-Lab-Programming.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Exercising in the Lab</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Exercising in the Lab"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-08-27"/>
<meta name="author" content="Howard Abrams"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>


<div id="content">
<h1 class="title">Exercising in the Lab</h1>

<p>That was a lot of typing in that previous console.  This next console
shows you how to repeat actions, using a command called <code>for..in</code>. 
</p>
<p>
In this case, we will repeat moving <code>forward</code> and turning to the
<code>left</code>. You just need to replace the <code>_</code> with the number of times we
should repeat the loop&hellip; that is, <code>4</code>.
</p>



<pre class="example">rv.connect("1-875E-65297D640A2D")

d = 7
for c in [1 .. _]
    rv.forward(d)   # Anything indent like this
    rv.left(90)     # will be repeated

rv.dock()
</pre>


<p>
The two commands that are <i>indented</i> will be done repeatedly, and the
<code>rv.dock</code> command, since it is not indented, is not part of the loop.
</p>
<p>
Good job!
</p>
<p>
<a href="03-Final-Lab.html">Next</a>
</p>


  <link href="styles/ui-darkness/jquery-ui.css" rel="Stylesheet"/>
  <script src="scripts/lib/underscore-min.js" type="text/javascript"></script>
  <script src="scripts/lib/jquery-1.9.1.js" type="text/javascript"></script>
  <script src="scripts/lib/jquery-ui.js"></script>
  <script src="scripts/lib/pen_min.js"></script>
  <script src="scripts/lib/coffee-script.js" type="text/javascript" charset="utf-8"></script>
  <link href="styles/main.css" type="text/css" rel="Stylesheet" />
  <link href="styles/console.css" type="text/css" rel="Stylesheet" />

  <script src="scripts/console.coffee" type="text/coffeescript"></script>
  <script src="scripts/veeps-rv-1.coffee" type="text/coffeescript"></script>


</div>

</body>
</html>
